{
  "tabs": [
    [
      "sobre",
      "about"
    ],
    [
      "habilidades",
      "skills"
    ]
  ],
  "skills": [
    {
      "name": "Scrum",
      "weight": 3
    },
    {
      "name": "Vue.js",
      "weight": 7
    },
    {
      "name": "jQuery",
      "weight": 5
    },
    {
      "name": "CSS3",
      "weight": 9
    },
    {
      "name": "Nuxt.js",
      "weight": 5
    },
    {
      "name": "PHP",
      "weight": 3
    },
    {
      "name": "React.js",
      "weight": 7
    },
    {
      "name": "Github",
      "weight": 5
    },
    {
      "name": "SQL",
      "weight": 3
    },
    {
      "name": "Gatsby.js",
      "weight": 5
    },
    {
      "name": "SASS",
      "weight": 7
    },
    {
      "name": "Bootstrap",
      "weight": 3
    },
    {
      "name": "Gulp.js",
      "weight": 5
    },
    {
      "name": "ESLint",
      "weight": 7
    },
    {
      "name": "ES6",
      "weight": 9
    },
    {
      "name": "Pug.js",
      "weight": 7
    },
    {
      "name": "Wordpress",
      "weight": 5
    },
    {
      "name": "Node.js",
      "weight": 3
    },
    {
      "name": "HUBL",
      "weight": 7
    },
    {
      "name": "Vuex",
      "weight": 5
    },
    {
      "name": "StyleLint",
      "weight": 7
    }
  ],
  "title": [
    "Sobre <b>mim</b>",
    "About <b>me</b>"
  ],
  "paragraphs": [
    [
      "Meu interesse pela programação veio antes mesmo de eu concluir o Curso Técnico em Informática no Instituto Federal Sul-Rio-Grandense de Charqueadas, pois desde o segundo ano fui participando de mostras e feiras cientificas, sendo responsável pelo planejamento e desenvolvimento de protótipos de software. Em todas essas feiras, tive a oportunidade de aprender sobre pesquisas de muitas outras áreas, dando destaque à <em>Mostratec</em>, onde, por ser uma mostra internacional, pude conhecer diferentes culturas também.",
      "My interest in coding began even before I graduated from my technical high school course, because I have attended scientific fairs and exhibitions since my sophomore year, including the opportunity I had of attending <em>Mostratec</em>, which is an international scientific fair where I got to experience other cultures and research areas."
    ],
    [
      "Assim que formado, iniciei meu estágio, no qual fui responsável pelo suporte ao cliente, assim como pelo gerenciamento de demandas dos demais atendentes e, também, pelo desenvolvimento de temas personalizados de acordo com a necessidade do cliente. Após o período do estágio obrigatório, fui efetivado por outra agência, tendo responsabilidades semelhantes, mas com algumas adicionais – como, por exemplo, ter todo o contato com o cliente após a contratação.",
      "As soon as I graduated, I started working at an internship, being responsible for customer support, managing other interns' tasks and developing customized <strong>WordPress</strong> themes according to each customer's interests. After my internship, I was hired by another agency with similar responsibilities, like staying in touch with the customer during the process until the project has been delivered."
    ],
    [
      "No ano de 2020, integrei a equipe da empresa porto-alegrense de marketing digital Trinto, para trabalhar usando <strong>Vue.js</strong>. Lá, fiz parte do <em>squad</em> dedicado que iria construir a nova vitrine digital do cliente especializada em cursos online. Lá, me destaquei rapidamente na equipe, recebendo uma promoção que veio com a expansão do time e com a renovação do contrato do cliente. Assim, adquiri um perfil de liderança na equipe sob os demais desenvolvedores front-end. Faziam parte das minhas novas responsabilidades o planejamento inicial de desenvolvimento, a revisão de códigos, a procura por melhorias e <em>bugs</em> e o repasse de <em>feedbacks</em> (ocasionalmente em reuniões mais formais e, também, em encontros diários), assim como as reuniões com o cliente e as resoluções dos mais variados problemas. Com essa renovação de contrato, o <em>squad</em>também ganhou um novo foco: passamos a utilizar a ferramenta <strong>Hubspot</strong>, sendo responsáveis pela criação de <em>landing pages</em>, de páginas promocionais, de salas de degustação, de modelos de página para o <strong>Hubspot CMS</strong>, etc.",
      "In the year of 2020, I became part of the team of the Brazilian digital marketing company, Trinto, to develop with <strong>Vue.js</strong>. There, I was part of the dedicated squad that would build our customer's new online courses showcase. There I quickly distinguished myself, receiving a promotion which came with our customer's contract renewal and our team's expansion, which brought me to a new leadership profile over our others front-end developers. Part of my new responsibilities were the project's initial development planning, reviewing codes, finding opportunities for improvement and bugs, giving feedback during meetings (daily when necessary), joining important meetings and general problem solving. With this contract renewal, our squad gained a new focus: using the <strong>Hubspot</strong> tool, now we were developing landing pages, promotional pages, sample classrooms and <strong>Hubspot CMS</strong> page templates."
    ],
    [
      "Ademais, foi no decorrer dessa trajetória que adquiri e pus em prática o conhecimento que obtive em <strong>ES6</strong> e <strong>CSS3</strong>, que considero essencial como entendimento avançado. Quanto às tecnologias que venho usado, acabo por desenvolver bastante em <strong>React</strong> com <strong>Gatsby</strong> e <strong>Vue</strong> com <strong>Nuxt</strong> consumindo <strong>APIs</strong>. Ganhei, também, experiência com <strong>PHP</strong> e alguns de seus <em>frameworks</em>, como <strong>CodeIgniter</strong> e <strong>Laravel</strong>.",
      "Furthermore, on my academic and professional path, I had the opportunity to practice the knowledge I acquired in <strong>ES6</strong> and <strong>CSS3</strong>, which I consider essential as advanced understanding. In relation to the technologies I have been using, I end up developing mostly in <strong>React</strong> with <strong>Gatsby</strong> and <strong>Vue</strong> with <strong>Nuxt</strong> consuming <strong>APIs</strong>. I also gained some experience with <strong>PHP</strong> and some of its frameworks, like <strong>CodeIgniter</strong> and <strong>Laravel</strong>."
    ]
  ]
}